[{"description": null, "title": "Apple Inc. Takes a Bold Risk With iPhone SE", "url": "http://www.fool.com/investing/general/2016/03/23/apple-inc-takes-a-bold-risk-with-iphone-se.aspx?source=yahoo-2&utm_campaign=article&utm_medium=feed&utm_source=yahoo-2", "symbol": "AAPL", "content": "<div><strong><img src=\"https://g.foolcdn.com/editorial/images/199751/iphonese-4colorfan-pr_us-en-print1_large.jpg\"></strong><em><a href=\"http://my.fool.com/profile/aeassa/info.aspx\">Ashraf Eassa</a> has no position in any stocks mentioned. The Motley Fool owns shares of and recommends Apple. Try any of our Foolish newsletter services free for 30 days. We Fools may not all hold the same opinions, but we all believe that <a href=\"http://wiki.fool.com/Motley\">considering a diverse range of insights</a> makes us better investors. The Motley Fool has a <a href=\"http://www.fool.com/Legal/fool-disclosure-policy.aspx\">disclosure policy</a>.</em><p><strong>Apple </strong>(NASDAQ: AAPL) finally went ahead and launched its widely anticipated 4-inch iPhone refresh dubbed the iPhone SE. The device is pretty much what everyone expected it to be; it combines the processing power, memory, and iSight cameras from the iPhone 6s, the wireless subsystem of the iPhone 6, and the external casing and display lifted from venerable iPhone 5s.</p><p>The \"bold\" and \"risky\" part of all of this is that Apple is offering the variant with 16 gigabytes of storage for just $399 and will sell customers one with a full 64 gigabytes of storage for $499. This has a very interesting implication.</p><p><strong>Apple is basically selling a better phone than the iPhone 6/6 Plus for less<br></strong> On the inside, arguably where it counts, the iPhone SE is a substantially better smartphone than either the iPhone 6 or the 6 Plus. It has significantly more processing power, packs in more memory, and contains a higher-resolution rear-facing camera.</p><p>Where the iPhone 6/6 Plus excel over the iPhone SE are the following:</p><ul><li>Display quality: The iPhone 6/6 Plus use higher resolution displays with superior viewing angles and contrast ratio.</li>\t<li>Display size: The iPhone 6/6 Plus offer significantly more screen real estate than does the iPhone SE.</li>\t<li>Industrial design: The iPhone 6/6 Plus are thinner and arguably more \"modern\" looking designs.</li></ul><p>Although many potential customers probably pay more attention to the above external/cosmetic features rather than on the processing power and features on the inside, a non-trivial portion of the iPhone-buying population will appreciate the relative value that the iPhone SE brings to the table specification-wise.</p><p>Apple may cannibalize, perhaps to a material degree, its older generation iPhone 6/6 Plus phones in the six month period or so that they occupy Apple's \"mid-tier.\" </p><p><strong>An attempt to try to juice iPhone sales with a \"value\" product<br></strong> The last time that Apple tried to launch a \"value\" product -- the iPhone 5c -- the device reportedly didn't do as well as the company had expected. Conversely, sales of the premium iPhone 5s performed better than expected, leading supply constraints in the company's first quarter of fiscal 2014 .</p><p>However, it's worth noting a couple of pretty significant differences between the iPhone 5c in late 2013 and the iPhone SE in early 2016.</p><p>First of all, the iPhone 5c packaged up the prior generation's internal components and camera subsystems in a less-premium plastic shell. Remember back then one of the key selling points of Apple's phones is that they were made out of aluminum and had a premium look and feel as a result.</p><p>The iPhone SE stands in stark contrast to the iPhone 5c. It comes in a nice metal casing, features top-of-the-line internal components, implements the same camera that the flagship iPhone 6s has, and comes with support for Apple Pay.</p><p>The iPhone SE also <em>starts </em>at $399 for the 16 gigabyte model and goes to $499 for the decked-out 64 gigabyte model. The iPhone 5c started life at $549 for the 16 gigabyte variant and went to $649 for the 32 gigabyte version.</p><p>The iPhone SE clearly provides a much better relative value to both Apple's own flagship products than the 5c did (some would, perhaps, argue that it's <em>too </em>close) and to the competition. Even with a small, fairly old display, the Apple A9 is arguably the most powerful mobile system-on-chip in the market today.</p><p><strong>Apple has a good product here <br></strong>I believe that the iPhone SE looks like a solid product that offers a tremendous amount of value for the money, especially relative to other members of the iPhone lineup. This looks like a great product with which to lure out folks in mature markets that simply don't want a larger iPhone as well as a solid tool with which to try to gain share in potentially more price-sensitive emerging markets.</p><p>The main risk that I see here is that Apple could very well see a substitution of sales of higher priced/higher margin iPhone 6/6 Plus phones in favor of the iPhone SE. </p><p>I plan to place an order for one as soon as it becomes available and hope to have a full review of the device published in early April. Stay tuned!</p><div><p><strong>3 companies poised to explode when cable dies</strong> <br>Cable is dying. And there are 3 stocks that are poised to explode when this faltering $2.2 trillion industry finally bites the dust. Just like newspaper publishers, telephone utilities, stockbrokers, record companies, bookstores, travel agencies, and big box retailers did when the Internet swept away their business models. And when cable falters, you don't want to miss out on these 3 companies that are positioned to benefit. <a href=\"http://www.fool.com/mms/mark/ecap-foolcom-cable?aid=5001&amp;source=isaeditxt0900015&amp;ftm_cam=sa-tv\">Click here</a> for their names. Hint: They're not the ones you'd think!</p></div></div>", "source": "Fool.com", "date": "Wed, 23 Mar 2016 19:30:00 GMT", "image": "http://g.foolcdn.com/editorial/images/199751/iphonese-4colorfan-pr_us-en-print1.jpg"}, {"description": "[ACN Newswire] - HONG KONG, Mar 19, 2016 - (ACN Newswire) - V1 Group Limited (the \"Company\" or \"V1\") is pleased to announce that the results of the Company and its subsidiaries (the \"Group\") for the full year of 2015. The profit attributable to the owners of the Company amounted to HK$142,666,000, as compared with a loss of HK$131,590,000 last year. The main source of income for V1 Group's lottery-related business derives from the websites set up and operated by the partners of the Group, including Lottery 365, a strategic cooperative mobile application developed by the business partner of the Group, \"Zhongguozucaiwang\"(www.zgzcw.com) and \"Diyicai\"(www.diyicai.com).", "title": "Interpretation on the Results of V1 Group for the Full Year of 2015", "url": "http://au.finance.yahoo.com/news/interpretation-results-v1-group-full-015500147.html", "symbol": "BIDU", "content": "<div><p>HONG KONG, Mar 19, 2016 - (ACN Newswire) - V1 Group Limited (the \"Company\" or \"V1\") is pleased to announce that the results of the Company and its subsidiaries (the \"Group\") for the full year of 2015. Turnover for the year amounted to HK$123,561,000 representing a decrease of around 62.1% as compared with last year, primarily due to the suspension of the sales of lottery tickets with effect from March 2015. Income from tele-media business amounted to HK$96,338,000 representing an increase of around 15% as compared with last year. The profit attributable to the owners of the Company amounted to HK$142,666,000, as compared with a loss of HK$131,590,000 last year. </p><p>Lottery-related Business</p><p>The main source of income for V1 Group's lottery-related business derives from the websites set up and operated by the partners of the Group, including Lottery 365, a strategic cooperative mobile application developed by the business partner of the Group, \"Zhongguozucaiwang\"(www.zgzcw.com) and \"Diyicai\"(www.diyicai.com). Such commercial cooperation also resulted in relevant income structure. </p><p>Income from lottery-related business amounted to HK$27,223,000, representing a decrease of around 88.8% as compared with the corresponding period last year. Segment loss for the whole year was HK$45,604,000 (2014: profit of HK$78,964,000). The unsatisfactory result for the period was mainly attributable to the adverse effects of the suspension of the operations of online sale of paperless lottery tickets and sale of lottery tickets through mobile phones of the Group's business partners in Mainland China with effect from 1 March 2015. Accordingly, the Group's lottery-related business has been suspended simultaneously. It is uncertain when the operation of the Group's lottery-related business will resume.</p><p>The Group's business partners will observe and comply with any new rules and regulations promulgated by the relevant PRC regulatory authorities and make adjustments to their operations of online sale of lottery tickets and sale of lottery tickets through mobile phones where necessary. The Group will actively cooperate with its business partners with an aim to have lottery-related business of the Group back on the track as soon as possible.</p><p>In early 2015, the monthly lottery sales at Zhonguozucaiwang and Lottery 365 reached another historical high, stimulated by the Asian Cup and game bets on fixed single matches. In March 2015, the Ministry of Finance, the Ministry of Civil Affairs and the General Administration of Sport of the PRC jointly promulgated the Notice on Issues Regarding Conducting Self-examination and Self-correction Activities of the Unauthorized Sale of Lottery through Internet, leading to the full suspension of internet sale of lottery tickets.</p><p>Thus, the Chinese internet lottery industry is facing the fifth time of rectification, and again the entire industry entered into a period of confusion on development. During the rectification period, the lottery-related business partners of V1 Group decided to develop through three main aspects, including \"Information and Data\", \"Game Entertainment and Value-added Services\" and \"Innovative Service Models\", exploring an efficient operating approach to boost user activity.</p><p>The website of Diyicai has undertaken an upgrade project, in order to enhance users loyalty and activity towards the website of the Group's lottery-related business. It is mainly focusing on the innovation on presenting lottery results, we are the first to present lottery results in forms of graphs, enabling the users to search for all kinds of lottery information such as the dividends, lottery pools and sales conveniently. Meanwhile, we have improved the user experience with a new website interface by modifying various interface designs such as the information modules, odds centers and real-time scores with respect to the website style and the channel features on website.</p><p>In April 2015, Zhongguozucaiwang launched a \"Lottery Information\" channel and its brand-new HTML5 version, with a precise focus on seven key matches, namely, \"Five European League Matches\", \"UEFA Champions League\", \"AFC Champions League\", \"Copa America\", \"FIFA Women's World Cup\", \"UEFA Euro Qualifying tournament\", and \"Chinese Football Association Super League\". The website has concentrated its resources on building a leading matches center of the industry and rolled out special features, schedule points, key rivals and matches analysis for important matches, with full coverage of the homepage search results of three main search engines - Baidu, 360 and Sogou. Furthermore, in respect of scores and information, Zhongguozucaiwang and Lottery 365 have introduced the real-time scores and odds data from Sportradar, encompassing more than 70 league and cup matches of such countries as England, Germany, Italy, Spain, France, Portugal, Switzerland, Norway, Brazil and China. The two websites lead the industry in terms of the speed and accuracy of real-time scores and odds changes, substantially enhancing the user experience of information access.</p><p>In May 2015, Zhongguozucaiwang and Diyicai saw a full recovery of their pageviews; in June 2015, the pageviews of both websites surpassed the record prior to the sales suspension. \"Information and Data\" played a key role in retaining users and maintaining user activity for the two websites.</p><p>In respect of game entertainment, Lottery 365 successively launched two main guessing games \"Guessing PK Game\" and \"Virtual Guessing of Football Game\", provide users with a chance of winning cash and prizes. Besides, \"Racetrack\", a Lottery 365's self-developed high frequency game is very popular among users, during the first week of its launch, its simultaneous users reached more than ten thousand.</p><p>In respect of innovative service model, the Group's lottery-related business partner has collaborated with \"Football\" newspaper, No.1 professional print media of sports in China, together with other business partners jointly roll out a platform for paid expert recommendations. A large number of famous domestic experts, such as Su Qun, Boshu, and Ding Weijie are invited to join the expert recommendation platform through the Lottery 365 and Zhongguozucaiwang, providing users with expert recommendations subscription service. It is intended to be developed as the biggest expert recommendations platform in the PRC.</p><p>In respect of product cooperation, Lottery 365 has been pre-installed in full range of Huawei \"Honor Play\" mobile phones in form of \"Cloud Folder\" and has also been listed on Huawei Application Market's recommended list as one of \"The Most Promising APP in 2015\". Meanwhile, Lottery 365 has become a lottery content provider for Baidu Application Platform, offering lottery results, lottery pools and related information on main lottery types such as Shuangseiqiu, Qixingcai, Qilecai, Pailiesan, Pailiewu for Baidu mobile application users.</p><p>In the first half of 2015, as a pioneer in the development of mobile internet industry, Lottery 365 won recognition from organizations and distribution platforms in mobile internet industry, winning successively \"The Most Popular APP in 2015\" award by Android Market, \"Popular APP Award\" by WoStore of China Unicom, and \"Top 50 in Innovation Competition\" by Global Mobile Internet Conference and etc. </p><p>Tele-media Business</p><p>Income from tele-media business amounted to HK$96,338,000 representing an increase of around 15.0% as compared with last year.</p><p>V1 Portal</p><p>V1 Portal is one of the largest micro video aggregation platforms in the PRC which gathers mini-videos across the PRC. With its intelligent personalized recommendation service, the website recommends headline videos for users according to their viewing habits. V1 Portal covers a wide range of program contents, including news, military, entertainment, film, comedy, sports, lifestyle, finance, technology, movie, TV drama and all kind of mini-videos. Users can stay home and easily get access to their needed information or entertainment programs. Moreover, V1 Portal website has integrated with its mobile application, achieving the real-time synchronization between computer and mobile platform, yielding the greatest publicity effect for the website. During the year of 2015, V1 Portal has two key news programs, namely the 70th Anniversary of the Victory of the Chinese People's War of Resistance against Japan and the second World Internet Conference.</p><p>On 24 June 2015, V1 New Media announced the launch of the largest Professionally Generated Content (PGC) platform project in China together with over 500 content providers, including Trends Group, Modern Sky, Feidieshuo and Zhengyun TV, with an aim to establish the largest \"Chinese YouTube\" platform in the world for millions of video creators in China to get rich ahead. Such transformation is regarded by the industry as a milestone in the development of Chinese video business.</p><p>In addition, regarding our self-produced programs, V1 Portal is producing programs under the principle of \"fine-quality strategy, in-depth interpretation, high-class entertainment and trendy style\" and based on the original programs such as \"National Spitslot\", \"World of Soldiers\" and \"Big Coming\", V1 Portal has tailor-made for users certain new programs such as \"Influential TV Series\" and \"Interpreting History\". As of November 2015, thousands of excellent PGC users have participated in the V1 PGC platform and there are quantities of quality video contents uploaded every day.</p><p>To better demonstrate the leading position of V1 Portal and its objective of transforming to PGC platform, V1 Portal has started its homepage revamp in May 2015. Based on the operation experience accumulated over years with reference to YouTube model and combined with Chinese elements, V1 Portal introduced the new v1.cn with a clean and user-friendly homepage. Meanwhile, with the assistance of our technical staffs, the operation team of the homepage has established a more responsive process to ensure rich and timely content delivery and offering users with better services.</p><p>V1Game Business</p><p>Due to the disposition of many web game producers or their transformation to mobile games area, the year of 2015 witnessed a significant decrease in number of new web games. However, the total number of web game users has remained almost unchanged at 330 million, which still demonstrating a healthy growth trend. Because of such decreased number of new web games, the joint operation platforms have to put more efforts in promoting the quality prime games. V1Game has quality prime web games such as \"Legend of Dominance\", \"Master God of War\", \"Great Ruler\", and \"World of the Sealed Book\", all of which are under vigorous promotion by each joint operation platform. We have also entered into strategic cooperation with Shang Fang Wan, which will carry out publicity with regard to our brand, exhibition, and channels for us, and V1Game will be responsible for platform set up, game operation and customer services. Moreover, we have joined hands with overseas operators to explore the foreign markets. We also leveraged our official WeChat account of V1Game as our key promotional strategy, and so far has attracted over 100,000 fans. It is convenient not only for the users to log on without registration, users can also experience and recharge for the games via our official WeChat account. In addition, V1Game has also offered exclusive VIP customer services to the high consumption users, with providing excellent personal services to VIP users constantly. This is the main reason why V1Game could accumulate users more rapidly and record more revenue than other competitors. Now, the user base is growing at approximately 15% month-on-month. </p><p>In terms of product category, the product mix of V1Game was generally in line with the industrial practices. Currently, 90% of its products are role play game (RPG). Among the categories of web game operating in the market, the number of RPG games is accounted for over 80% of market share. RPG games can stimulate players' consumption at a greater extent, as they have a stronger vicarious feeling, easy to play and with simple game battle mechanism. V1Game has variety types of games ranging from legend, mythical realm, magic and the three kingdoms to martial arts, which able to meet the needs of different users largely.</p><p>Apart from the continual endeavors on web games, V1Game has also launched its own HTML5 (H5) game platform (www.v1h5.com) riding on the development trend of the industry. The platform has now gathered approximately 1,000 high quality H5 mini-games. No matter mobile or computer users, after they logged on the game platform, users can play their favorite games immediately without downloading.</p><p>Currently, V1H5 Platform has begun to take shape. In the 2015 HTML5 Annual Awards held by \"HTML5 DreamWorks\", the most reputable organization among peers, V1H5 Platform was honored with \"2015 New Company with Greatest Potential\". Moreover, the self-developed game \"Candy Bumpers\" was honored the award of \"Product with Greatest Development Potential\" in \"China Original Android Game Competition\" co-organized by \"China Telecoms e' game\" and \"Game channel of People.cn\". Now, \"Candy Bumpers\" talks to cooperate with well-known platforms such as Baidu Tieba Platform, Tencent Wanba Platform, and Sina Weibo Platform have been kicked off.</p><p>By virtue of the comprehensive strength of V1 Group, V1Game has already been recognized by various peers in the industry and has been in very close cooperative relationship with most of research and development companies and joint-operating companies. Meantime, V1Game has successfully developed a web game operation alliance which is exclusive to V1H5 Platform. Through this web game operation alliance, all individuals, companies and webmasters of game sites can join us for operation and promotion of the web games.</p><p>In terms of H5 games, V1Game has already decided to take the brand-new concept of \"Interaction between Sports and Games\" as its core product strategy of 2016. At present, V1Game has entered into an exclusive cooperative agreement with Beijing Happy New Games to develop a H5 game on sports competition named \"It's up to Fans\". The preparations for its operation have commenced after the Spring Festival of 2016. The game feature is the users can participate in the sports matches in real time through a game mode, aiming to build the first platform for social sports games in China with the concept of \"Interaction between Sports and Games\". With the Europa League on and the Olympic Games to be held in Rio de Janeiro, Brazil in 2016, \"Interaction between Sports and Games\" is definitely to be driven to a new climax.</p><p>V1Game has currently launched new functions of \"One Yuan for Treasure\" and \"Platform Points\". By offering users an opportunity winning remarkable bonus with limit budget, \"One Yuan for Treasure\" encourages users to play in small amount but high frequency, in order to enhance user activity and stickiness of the platform. \"Platform Points\" is also design for enhancing the user activity. By completing certain tasks, the users can obtain points for exchanging different items or game recharging cards on the platform. These functions have positive role in promoting products on the platform. Additional functions will be rolled out in the future, with a view to improve the platform and provide users with new experience continuously.</p><p>Healthcare Home</p><p>In December 2015, V1 Group launched a new mobile application named \"Healthcare Home\", the most subversive \"Internet Plus\" medical product in the PRC, this mobile application is differentiated from those online diagnosis model in the market, it is a brand new service philosophy with providing healthcare information services in respect of, among other things, doctors' appointment, nursing home care, Chinese medicine therapy and follow-up consultation for chronic disease according to patients' real needs.</p><p>Nursing home care services are provided by Healthcare Home platform in cooperation with Grade A Class III Nurses Group, which is the first nurses group in the PRC consisting of more than 1,000 registered nurses from Grade A Class III hospitals such as Peking Union Medical College Hospital, Peking University People's Hospital, Ruijin Hospital Shanghai and The First Affiliated Hospital of Sun Yet-sen University in Guangdong, etc. The nursing home care services involve the provision of injection, infusion, urinary catheterization, nasal feeding, and wound dressing services by nurses authenticated by the platform on site. At present, Healthcare Home has authenticated over 3,000 registered nurses who are certificated by National Health and Family Planning Commission of China (NHFPC), 80% of which have 3 years or above practicing experience, covering 76 large and medium sized cities including Beijing, Shanghai, Guangzhou, Shenzhen, Nanjing, Hangzhou, Jinan and Chongqing. Authenticated nurses would \"grab\" orders on Healthcare Home information platform and provide nursing home care services for the patients hereby.</p><p>Doctors' appointment service is working through an authenticated open platform for hospital companion services operating on Healthcare Home platform. It provides hospital companion and doctors' appointment services for patients across the PRC, the authenticated companion groups including doctors, nurses, and student groups near hospitals. Users can send their appointment or hospital companion service requests via our Healthcare Home mobile application and the hospital companion professionals will get the order by a \"grabbing\" mode, and will provide doctor appointment and hospital companion services for users. By now, Healthcare Home has authenticated more than 900 hospital companion professionals in 39 cities including Beijing, Shanghai, Guangzhou, Shenzhen, Nanjing, Hangzhou, Chengdu and Xi'an, who will provide hospital companion services such as hospital guide, doctor appointment, classified treatment and information about hospital surroundings.</p><p>Chinese medicine therapy and follow-up consultation for chronic diseases are provided by Grade A Class III Traditional Chinese Medicine Group, which co-founded by Healthcare Home and more than 600 Chinese medicine practitioners from Grade A Class III hospitals such as Beijing Hospital of TCM, Guang'anmen Hospital, Xiyuan Hospital CACMS, Dongzhimen Hospital Beijing University of Chinese Medicine, Shanghai Shuguang Hospital and Guangdong Provincial Hospital of Traditional Chinese Medicine. The services including the provision of home care manipulation, massage, scrapping therapy, and cupping therapy, and follow-up consultation for chronic diseases such as diabetes, high blood pressure, cardio-cerebrovascular disease etc., as well as health guidance service to the patients nearby. By establishing an information service platform connecting doctors and patients, it aims to promote initial diagnosis of chronic diseases like diabetes, high blood pressure, cardio-cerebrovascular disease in grassroots level. In addition, the Healthcare Home platform also offers information service on nursing workers, maternity matrons and prolactin experts.</p><p>In order to implement the Guiding Opinions of the State Council on Actively Propelling the Internet Plus Action and Guiding Opinions of the State Council on Advancing the Combining of Medical and Health Services and Elderly Care Services, Healthcare Home and National Aging Information Center entered into a strategic cooperation agreement, whereby product series of Healthcare Home officially become the first internet healthcare service pilot product in the PRC.</p><p>As a key mobile health information service platform built by V1, Healthcare Home has entered into a strategic partnership with PICC Property and Casualty Company Limited, whereby providing free accident comprehensive protection services to doctors, nurses and patients who are using Healthcare Home, freeing them from worries for accidents. Healthcare Home information service platform has built up a healthcare sharing economy business model, which offers all-rounded rehabilitation services such as doctor's appointment services, nursing home care services, Chinese medicine therapy and follow-up consultation for chronic diseases, by integrating social resources including doctors, nurses, students and residents near hospital and reconstructing the healthcare service supply chain, and thus help solving the insufficient healthcare service supply problem to certain extent.</p><p>With differentiated product service, Healthcare Home was specially recommended by Apple App Store and swiftly jumps to top among its \"Medical\" category in China. Besides, on the first day of launching the Android version of Healthcare Home, it was recommended by various application distribution platforms such as Tencent Myapp, Baidu Mobile Phone Assistant, 360 Mobile Phone Assistant, Huawei Application Market, Xiaomi App Store. At present, Healthcare Home mobile application has achieved over 1 million downloads, becoming the most fast-growing healthcare-related mobile phone application in China and gradually becoming an industry parvenu building brand-new business model for mobile healthcare.</p><p>Mobile Games Business</p><p>For the year of 2015, the mobile games business segment revenue decrease to HK$1,168,121,000, representing a decrease of around 27.9% as compared with the corresponding period in 2014.</p><p>Decrease in revenue was attributable to the Company disposed of its entire interest in CMGE on 10 August 2015. After that CMGE ceased to be a subsidiary of the Company. The Group's mobile games business has discontinued and the revenue and profit of mobile game business were not recognized in the Group's revenue and result since then.</p><p>Nevertheless, segment profit of mobile games business increased by 230.5% to HK$846,315,000 when compared with HK$256,061,000 in the year of 2014. The strong financial performance was driven by the profit arising from the disposal of the interest in CMGE during the year.</p><p>Copyright 2016 ACN Newswire . All rights reserved.</p></div>", "source": "Yahoo", "date": "Sat, 19 Mar 2016 01:55:00 GMT", "image": "https://s1.yimg.com/bt/api/res/1.2/M7vS95b2fvSzHFeFStPk0A--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://l.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png"}, {"description": "[Business Wire] - Electronic Arts Inc. today announced the official launch of EA SPORTS™ UFC® 2, available in retail stores and as a digital download on Xbox One and PlayStation 4. The game features the largest roster ever for an official UFC game, boasting more than 250 athletes, including cover stars, UFC featherweight champion Conor McGregor and former UFC bantamweight champion Ronda Rousey.", "title": "Finish the Fight in EA SPORTS UFC 2 Available Now", "url": "http://finance.yahoo.com/news/finish-fight-ea-sports-ufc-150000293.html", "symbol": "EA", "content": "<div><p><figure><a href=\"http://finance.yahoo.com/news/finish-fight-ea-sports-ufc-150000293.html\"><img src=\"http://l3.yimg.com/bt/api/res/1.2/f.ndGGYOFVBq6xRnri3V5w--/YXBwaWQ9eW5ld3NfbGVnbztmaT1maWxsO2g9MTY5O3E9NzU7dz0zMDA-/http://globalfinance.zenfs.com/en_us/Finance/BUSINESSWIRE/ba1c7cc5abf06a6ae9eee569135e650d\"></a></figure></p><p>REDWOOD CITY, Calif.--(BUSINESS WIRE)--</p><p> <a href=\"http://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.ea.com%2F&amp;esheet=51300479&amp;newsitemid=20160315005551&amp;lan=en-US&amp;anchor=Electronic+Arts+Inc.&amp;index=1&amp;md5=4b49f4155e9d55d6479d295b801b825c\">Electronic Arts Inc.</a> ( <a href=\"http://finance.yahoo.com/q?s=ea\">EA</a>) today announced the official launch of <i>EA SPORTS&#8482; UFC</i><sup><i>&#174;</i></sup><i> 2</i>, available in retail stores and as a digital download on Xbox One and PlayStation 4. The game features the <a href=\"http://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.easports.com%2Fufc%2Ffighter-roster&amp;esheet=51300479&amp;newsitemid=20160315005551&amp;lan=en-US&amp;anchor=largest+roster+ever+for+an+official+UFC+game&amp;index=2&amp;md5=80f614163db45f0aeba8779341f84fbf\">largest roster ever for an official UFC game</a>, boasting more than 250 athletes, including cover stars, UFC featherweight champion Conor McGregor and former UFC bantamweight champion Ronda Rousey. The game also includes all-time fighting legends like Mike Tyson, UFC Hall-of-Famer Bas Rutten, Kazushi Sakuraba, and Bruce Lee - all unlockable by making it to the UFC Hall of Fame in Career Mode. <i>EA SPORTS UFC 2</i> also introduces a <a href=\"http://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.easports.com%2Fufc%2Ffeatures&amp;esheet=51300479&amp;newsitemid=20160315005551&amp;lan=en-US&amp;anchor=Knockout+Physics+System&amp;index=3&amp;md5=ea06b5ed0e041234ba278ef11f0c74ef\">Knockout Physics System</a> that, when paired with thousands of new animations and updated character likenesses, makes knockouts more dynamic and realistic than ever. </p><p>This Smart News Release features multimedia. View the full release here: <a href=\"http://www.businesswire.com/news/home/20160315005551/en/\">http://www.businesswire.com/news/home/20160315005551/en/</a></p><p> \"By listening to fans, sharpening our fundamentals, focusing on areas of innovation in gameplay, and adding massive depth to modes, we believe we've taken the franchise and MMA games to the next level with this one,\" said <i>EA SPORTS UFC 2</i> Creative Director Brian Hayes. \"We're excited that it's finally time to ask fans to stare back at their opponent, bite down on their mouth piece, come out swinging and finish the fight.\" </p><p> <i>EA SPORTS UFC 2 </i>delivers a <a href=\"http://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.easports.com%2Fufc%2Ffeatures&amp;esheet=51300479&amp;newsitemid=20160315005551&amp;lan=en-US&amp;anchor=mode+for+every+fight+fan&amp;index=4&amp;md5=5eed82660b460d4e0286987c0b7edc62\">mode for every fight fan</a>, including the series introduction of Custom Event Creator, UFC Ultimate Team <i>&#8482;</i>, and Live Events which allow players to gain in-game rewards for playing out real-world fight cards before they happen. The game also features the brand-new Knockout Mode, which does away with clinches, grappling and submissions in favor of pure heart-pounding, stand-up fighting action. However, when fights do go to the ground, <i>EA SPORTS UFC 2 </i>gives fighters the tools to master mixed martial arts (MMA), including <a href=\"http://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.easports.com%2Fufc%2Fnews%2F2015%2Ftools&amp;esheet=51300479&amp;newsitemid=20160315005551&amp;lan=en-US&amp;anchor=Grapple+Assist&amp;index=5&amp;md5=598d0a64e43c18a7edc8f3f272fadba4\">Grapple Assist</a>, a new graphic overlay that helps fans dominate the clinch and find their next move on the ground. </p><p> \"This game is an authentic representation of the UFC brand experience, bringing the excitement of the Octagon to life for all fight fans,\" UFC Senior Vice President of Global Consumer Products Tracey Bleczinski said. \"From the walkout, incorporating the new UFC Fight Kit, to the intensity of being face-to-face with the top combat sports athletes in the world, this game has it all.\" </p><p> Assets for <i>EA SPORTS UFC 2 </i>can be found <a href=\"http://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Finfo.ea.com%2Fproducts%2Fp1503%2Fufc-2%3Ftype%3Dscreenshot&amp;esheet=51300479&amp;newsitemid=20160315005551&amp;lan=en-US&amp;anchor=here&amp;index=6&amp;md5=33aa6b1654466416cf48b232278dbad3\">here</a> and game trailers can be watched <a href=\"http://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3Dm97UWd2QuAI%26list%3DPLJiVGeJ_KPz5irtv1TRlSmZmVuAFwEBgN%26index%3D3&amp;esheet=51300479&amp;newsitemid=20160315005551&amp;lan=en-US&amp;anchor=here&amp;index=7&amp;md5=155df25c13d1cd6a67c89cb35e7e3294\">here</a>. </p><p> <i>EA SPORTS UFC 2 </i>is developed by EA Vancouver, and is available now in North America and will be available March 17 worldwide on Xbox One and PlayStation 4. EA Access* members can try the full game for a limited time and get 10% off the digital version of the game on Xbox One. Fans should keep an eye on the <a href=\"http://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.easports.com%2Fufc&amp;esheet=51300479&amp;newsitemid=20160315005551&amp;lan=en-US&amp;anchor=website&amp;index=8&amp;md5=6f091b78f0f0eb8ca0a45a0a9e1738bb\">website</a>, as well as the <i>EA SPORTS UFC </i><a href=\"http://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fwww.facebook.com%2FEASPORTSUFC%2F&amp;esheet=51300479&amp;newsitemid=20160315005551&amp;lan=en-US&amp;anchor=Facebook&amp;index=9&amp;md5=9de2c77c9dac83b879807ff4742af5b6\">Facebook</a> and <a href=\"http://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Ftwitter.com%2FEASPORTSUFC&amp;esheet=51300479&amp;newsitemid=20160315005551&amp;lan=en-US&amp;anchor=Twitter&amp;index=10&amp;md5=0b34da0e87303d2ff70cd0214ce94e6d\">Twitter</a> pages to make sure they're always up-to-date on the latest and greatest news. </p><p> EA SPORTS&#8482; is one of the leading sports entertainment brands in the world, with top-selling videogame franchises, award-winning interactive technology, fan programs and cross-platform digital experiences. EA SPORTS creates connected experiences that ignite the emotion of sports through videogames, including <i>Madden NFL</i> football, <i>EA SPORTS&#8482;</i> <i>FIFA</i>, <i>NHL</i><sup><i>&#174;</i></sup> hockey, <i>NBA LIVE </i>basketball, <i>Rory McIlroy PGA TOUR</i><sup><i>&#174;</i></sup> golf, and <i>EA SPORTS UFC</i><sup><i>&#174;</i></sup>. </p><p> For more information about EA SPORTS, including news, video, blogs, forums and game apps, please visit <a href=\"http://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.easports.com&amp;esheet=51300479&amp;newsitemid=20160315005551&amp;lan=en-US&amp;anchor=www.easports.com&amp;index=11&amp;md5=54d6e2f014576a1ece5272633de12f7c\">www.easports.com</a> to connect, share and compete. </p><p> *CONDITIONS, LIMITATIONS AND EXCLUSIONS APPLY. SEE  <a href=\"http://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fea.com%2FEAACCESS&amp;esheet=51300479&amp;newsitemid=20160315005551&amp;lan=en-US&amp;anchor=EA.COM%2FEAACCESS%2FTERMS&amp;index=12&amp;md5=3b81fccb1fff601d9afb7e76bbea5592\">EA.COM/EAACCESS/TERMS</a> AND <a href=\"http://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fea.com%2FEAACCESS&amp;esheet=51300479&amp;newsitemid=20160315005551&amp;lan=en-US&amp;anchor=EA.COM%2FEAACCESS&amp;index=13&amp;md5=7ac617b6eb8ece21322fb145a21a632f\">EA.COM/EAACCESS</a> FOR DETAILS. </p><p> Please <a href=\"mailto:kakeith@contractor.ea.com?subject=Unsubscribe%20from%20News%20Alerts\">click here</a> to unsubscribe from these alerts. </p><p>View source version on businesswire.com: <a href=\"http://www.businesswire.com/news/home/20160315005551/en/\">http://www.businesswire.com/news/home/20160315005551/en/</a> </p><p>MULTIMEDIA AVAILABLE: <a href=\"http://www.businesswire.com/news/home/20160315005551/en/\">http://www.businesswire.com/news/home/20160315005551/en/</a></p></div>", "source": "Yahoo", "date": "Tue, 15 Mar 2016 15:00:00 GMT", "image": "http://l1.yimg.com/bt/api/res/1.2/dtweYHozn.Y81H2f4FRaQA--/YXBwaWQ9eW5ld3NfbGVnbztxPTc1O3c9NjAw/http://globalfinance.zenfs.com/en_us/Finance/BUSINESSWIRE/ba1c7cc5abf06a6ae9eee569135e650d.cf.png"}, {"description": "[at Investor's Business Daily] - Groupon's (GRPN) pledge to trim down and over-deliver as it transforms its operations drew praise Tuesday from investment bank William Blair. Groupon interim CFO Brian Kayman and investor relations chief ...", "title": "Groupon Could Get More Users From Facebook In New Social Media Push", "url": "http://www.investors.com/news/technology/groupon-could-get-more-users-from-facebook-in-new-social-media-push/?ven=YahooCP&src=AURLLED&ven=yahoo", "symbol": "GRPN", "content": "<div><img src=\"http://www.investors.com/wp-content/uploads/2016/03/IT15-GRPN-031516.jpg\"><p><strong>Groupon</strong>'s ( <a href=\"http://www.investors.com/news/technology/groupon-could-get-more-users-from-facebook-in-new-social-media-push/\">GRPN</a>) pledge to trim down and over-deliver as it transforms its operations drew praise Tuesday from investment bank William Blair.</p><p>Groupon interim CFO Brian Kayman and investor relations chief Tom Grant said in meetings with William Blair last week that the company \"had a tendency to 'get ahead of its skis' in terms of priorities and financial targets,\" wrote analyst Ralph Schackart.</p><p>That \"overly-broad approach ... led to some mis-execution,\" Schackart said. \"Going forward, the company is focused on executing against a narrower set of priorities to regain investor confidence, and it is attempting to set less ambitious guidance targets.\"</p><p>In a restructuring expected to be completed by September, Groupon is shutting down in unprofitable countries and scaling back low-margin goods.</p><p>Groupon reported Q4 earnings that beat consensus, Schackart said, and now Groupon shares \"are up 35% year-to-date - the highest of any company on our coverage list.\" But it's now up just 25%, with Groupon stock down 7% in midday trading in the  <a href=\"http://www.investors.com/category/market-trend/stock-market-today/\">stock market today</a>, near 3.80.</p><p>Schackart said \"the company will need to show consistent execution against stated guidance for multiple quarters to regain increased investor confidence.\"</p><p>William Blair maintained a market perform rating on Groupon stock.</p><h2>Will Groupon's Marketing Spend Produce Results?</h2><p>A key focus for investors is Groupon's $150 million to $200 million incremental marketing investment for 2016, he said, especially since executives \"noted that price, frequency and active customers are the three primary revenue drivers, and the incremental marketing spending will be focused on adding new customers.\"</p><p>On Tuesday, <a href=\"http://investor.groupon.com/releasedetail.cfm?releaseid=960719\">Groupon announced</a> a series of website, mobile and tablet enhancements designed to make it easier for merchants to track and manage their Groupon campaigns.</p><p>Groupon's plans to use social media and search engine marketing in new ways drew praise. \"For example, it might target people on <strong>Facebook</strong> ( <a href=\"http://www.investors.com/news/technology/groupon-could-get-more-users-from-facebook-in-new-social-media-push/\">FB</a>) who do not have the Groupon app with a mobile installation advertisement or bid on higher-level search words than in the past,\" Schackart wrote.</p><p>Other analysts have been more skeptical.</p><p>\"While Groupon has recently shown signs of progress in its transformation to an e-commerce marketplace and its core initiatives (including streamlining its international operations or customer acquisition), we believe there is still a long road ahead in strengthening the company's positioning in the local ad and/or local e-commerce market,\" wrote UBS analyst Eric Sheridan in an industry note on March 9. \"Meanwhile, larger Internet companies, predominantly <strong>Alphabet</strong> ( <a href=\"http://www.investors.com/news/technology/groupon-could-get-more-users-from-facebook-in-new-social-media-push/\">GOOGL</a>) subsidiary Google and Facebook, are increasing their efforts to capture local ad dollars, while <strong>Amazon</strong>'s ( <a href=\"http://www.investors.com/news/technology/groupon-could-get-more-users-from-facebook-in-new-social-media-push/\">AMZN</a>) same-day delivery service reduces the benefit of a local marketplace.\"</p><p>Sheridan downgraded Groupon to sell from neutral and set a price target of 3.20. Sheridan sees several \"key weaknesses\" in Groupon's competitive position, including marketing spend that will pressure near-term margins, rising competition, a shift to lower-margin business and slowing customer and engagement growth.</p><p>Sheridan blamed those troubles on Groupon's international retrenchment and its \"lack of operating profit scale to drive additional investments in innovation that might counteract the platform strength of Google and Facebook.\"</p><p>Groupon's changes come as others are also tweaking their strategies.</p><p>Last week, <strong>Angie's List</strong> ( <a href=\"http://www.investors.com/news/technology/groupon-could-get-more-users-from-facebook-in-new-social-media-push/\">ANGI</a>) got a revenue outlook boost from Pacific Crest Securities, which praised the online review site's <a href=\"http://www.investors.com/news/technology/millennials-prompt-angies-list-to-tear-down-paywalls-go-free-ceo/\">recent decision to drop</a> its current membership model and replace it with free access to its business ratings and reviews as part of a tiered subscription plan.</p><p>The addition of the free tier \"should reignite user growth,\" wrote Pacific Crest analyst Evan Wilson in a research report last week.</p></div>", "source": "Investors.com", "date": "Tue, 15 Mar 2016 16:32:51 GMT", "image": "http://www.investors.com/wp-content/uploads/2016/03/IT15-GRPN-031516.jpg"}, {"description": "[at Forbes] - The new Paul G. Allen Frontiers Group, backed by $100 million from the Microsoft co-founder, will provide vital funding to scientists with out-there ideas for solving medical problems.", "title": "Paul Allen's Plan To Pour $100M Into 'Out-Of-The-Box' Biotech Research", "url": "http://www.forbes.com/sites/arleneweintraub/2016/03/23/paul-allens-plan-to-pour-100m-into-out-of-the-box-biotech-research/?utm_campaign=yahootix&partner=yahootix", "symbol": "MSFT", "content": null, "source": "Forbes", "date": "Wed, 23 Mar 2016 18:00:00 GMT", "image": "http://specials-images.forbesimg.com/imageserve/457921174/640x434.jpg?fit=scale"}, {"description": "[Business Wire] - SEATTLE--(BUSINESSWIRE)-- Starbucks Corporation (NASDAQ:SBUX - News) today hosted its 24th Annual Meeting of Shareholders, with more than 2,800 partners, shareholders, invited guests and board members in attendance. Howard Schultz, chairman and ceo of Starbucks, honored the accomplishments of the company in delivering record financial results and introduced the company’s next level of social impact initiatives.", "title": "Building on Its Highest Total Shareholder Return in More Than Ten Years, Starbucks Presents Its Global Growth Agenda and Plans for Social Impact at Annual Meeting of Shareholders", "url": "http://au.finance.yahoo.com/news/building-highest-total-shareholder-return-170000871.html", "symbol": "SBUX", "content": "<div><p>SEATTLE--(BUSINESSWIRE)-- Starbucks Corporation (NASDAQ: <a href=\"https://au.finance.yahoo.com/q?s=sbux\">SBUX</a> - <a href=\"https://au.finance.yahoo.com/q/h?s=sbux\">News</a>) today hosted its 24 <sup>th</sup> Annual Meeting of Shareholders, with more than 2,800 partners, shareholders, invited guests and board members in attendance. Howard Schultz, chairman and ceo of Starbucks, honored the accomplishments of the company in delivering record financial results and introduced the company's next level of social impact initiatives.</p><p>\"There are very few consumer brands in the world - products or experiences - that have created both an undeniable customer attachment to the brand while also seeing universal acceptance. And, we take none of that for granted. We have to earn it every day,\" said Howard Schultz, chairman and ceo of Starbucks Corporation. \"In addition to earning our customers' trust and respect, we also cannot be a bystander at a time in our nation's history when government gridlock, economic disparity and partisan polarization continue to stunt our progress. In our view, the private sector must contribute more as an economic and social force in partnership with all other sectors.\"</p><p><b>FY15 Financial Highlights/ Achievements</b></p><p>Starbucks highlighted the interdependence of business success with driving social impact at scale and cited Starbucks record revenues of $19.2 billion (17 percent growth over FY14) and record non-GAAP earnings per share of $1.58 <sup>1</sup> (19 percent growth on a non-GAAP basis <sup>1</sup>) in fiscal 2015; $3.7 billion in non-GAAP operating income <sup>2</sup> (19 percent growth on a non-GAAP basis <sup>2</sup>) in fiscal 2015; and $2.4 billion returned to shareholders in the form of dividends and share repurchases. Starbucks also invested $284 million in healthcare benefits and $167 million in <i>Bean Stock</i> in FY15.</p><p><b>Starbucks Growth Agenda Outlined Across Geographies and Disciplines</b></p><p>Kevin Johnson, president and chief operating officer, highlighted Starbucks approach to elevating the brand across retail, channel development and digital through new innovation, reaching new customers and creating new occasions for customer visits. Johnson highlighted the company's growth ambitions across the Americas, EMEA and China/Asia Pacific in retail, digital and channel development.</p><p>Building on the success of the Teavana brand in Starbucks channels in the U.S. and Canada, Johnson unveiled the company's plans to extend the Teavana brand into Starbucks retail stores across EMEA and China/Asia Pacific by the end of the fiscal year. Tea has grown by 17 percent over the prior year with all tea categories posting strong growth, led by iced tea at 29 percent.</p><p>\"Our focus on connecting with customers and delivering experiences across our retail, channel development, and digital businesses, continues to elevate the Starbucks brand,\" said Kevin Johnson, president and chief operating officer of Starbucks. \"This is a tribute to the 300,000 people who proudly wear the Green Apron and serve customers in 70 countries around the world. This focus and hard work has enabled us to deliver record results and significant value for our shareholders.\"</p><p><b>Starbucks Cementing its Global Leadership Role in Single Serve Coffee and Ready to Drink Beverages</b></p><p>By bringing the <i>Starbucks Experience</i> to customers outside its retail stores in a brand accretive way, Starbucks Channel Development continues to demonstrate industry leading growth with $1.7 Billion in revenue in FY15 and 17.4 percent growth in operating income. \"We are elevating Starbucks by taking inspiration from our stores and bringing high quality, innovative products to our customers around the world,\" said Michael Conway, president, Global Channel Development from the stage at today's meeting. Two key announcements were shared during Conway's remarks. The first being the launch of Starbucks Ready to Drink Cold Brew Coffee in the U.S. through the North American Coffee Partnership with PepsiCo. This premium, smooth tasting coffee delivers craft cold brew on the go and will be introduced this summer. The second was Starbucks commitment to strengthening its global leadership position in the nearly $8 Billion premium single cup coffee category. This will come to life through an updated agreement with Keurig Green Mountain to continue to be the supplier of Starbucks K-cup pods. The companies updated their agreement to provide greater flexibility in driving product innovation and more control over quick and deep expansion of our products into channels beyond grocery. Additionally, this summer in the U.S., Starbucks will launch an entirely new beverage line for the Keurig hot system - the Starbucks Latte which will include customer favorites including Caramel, Mocha and Vanilla Latte. Lastly, this summer in Europe, Starbucks will launch espresso capsules which are compatible with Nespresso&#174;* machines which will be sold first in UK and France through sales in Starbucks retail stores, grocery and online.</p><p><b>New Game-Changing Advances in Digital Customer Experience - With Loyalty at the Core</b></p><p>Also on stage, Johnson presented the growth of the company's strategic digital flywheel of platforms. At the core of Starbucks digital ecosystem is loyalty. In February, Starbucks unveiled changes to its loyalty program which created a level playing field for Starbucks customers to earn 2 stars for every dollar spent. Since that announcement, more than 500,000 customers signed up for Starbucks Rewards. In addition, total active members of Starbucks Rewards are now reaching more than 12 million members in the U.S., up 1 million over the past quarter. The new program will go into effect on April 12.</p><p>This evolution also allows Starbucks the ability to create new ways for customers to engage in the program outside of Starbucks. Last October, Starbucks announced that Chase Commerce Solutions replaced Square as its payments processor. And recently, Starbucks entered into a payments agreement to accept Chase Pay. Today, Starbucks expands this partnership with the announcement of a new product called the Starbucks Rewards Prepaid Card from Chase.</p><p>Available by the end of this year, the Starbucks Rewards Prepaid Card is a reloadable prepaid card that allows customers to earn stars for all card purchases made virtually anywhere that Visa is accepted. Customers will be able to apply for the Starbucks Rewards Prepaid Card through the Starbucks Mobile App or Starbucks.com. This new model is just the beginning of Starbucks opening up its digital ecosystem as well as extending its payment platform.</p><p><b>Creating Social Impact/Building a Purpose-Driven Workforce</b></p><p>Starbucks partners represent diverse views, backgrounds, experiences and ideas, creating a culture of people unified in an aspiration to make a positive difference both in and outside of stores. At recent Partner Open Forums, in direct conversations, and across social platforms, Starbucks partners have voiced their aspirations as global citizens, asking the company to engage on important societal issues and participate in their communities and countries. Today, Starbucks is making three specific commitments in collaboration with leading institutions in an effort to help find solutions to complex societal problems and to create long term impact and sustainability.</p><p></p><ul><li><b>Starbucks Teams Up with Democracy Works to launch TurboVote Challenge:</b> Building upon its demonstrated track record of joining like-minded organizations to create meaningful social impact at scale, Starbucks will support the non-profit<a href=\"http://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fdemocracy.works%2F&amp;esheet=51306084&amp;newsitemid=20160323006248&amp;lan=en-US&amp;anchor=Democracy+Works&amp;index=1&amp;md5=de5dcf3fd49711d2214f5fa43ba8b9f2\">Democracy Works</a> and its <a href=\"http://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fdemocracy.works%2Fturbovote%2F&amp;esheet=51306084&amp;newsitemid=20160323006248&amp;lan=en-US&amp;anchor=TurboVote+project&amp;index=2&amp;md5=91f4d440df3566691ac2522914a1e4f4\">TurboVote project</a> to strengthen democracy and elevate citizenship in America<i>.</i> In the \"<a href=\"http://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fdemocracy.works%2F&amp;esheet=51306084&amp;newsitemid=20160323006248&amp;lan=en-US&amp;anchor=TurboVote+Challenge%2C%E2%80%9D&amp;index=3&amp;md5=2914e4aceaca4d5627a32f35c8b0c40e\">TurboVote Challenge,\"</a> Starbucks will be joined by Airbnb, Arizona State University, Fusion, Lyft, Mic, Spotify, Target, theSkimm, Univision, The Video Game Voters Network, Westfield Corporation, WeWork and others in an effort to engage 80 percent of all eligible voters to participate in our democracy by 2020. By comparison, fewer than 60 percent of eligible voters cast ballots in the 2012 national elections. Today's announcement follows Starbucks<a href=\"http://cts.businesswire.com/ct/CT?id=smartlink&amp;url=https%3A%2F%2Fnews.starbucks.com%2Fviews%2Fstarbucks-encourages-civic-engagement&amp;esheet=51306084&amp;newsitemid=20160323006248&amp;lan=en-US&amp;anchor=long+history&amp;index=4&amp;md5=7c903ece6880f9ac0e5834ccdf9cac64\">long history</a> of encouraging civic engagement, including supporting the <a href=\"http://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fbipartisanpolicy.org%2F&amp;esheet=51306084&amp;newsitemid=20160323006248&amp;lan=en-US&amp;anchor=Bipartisan+Policy+Center&amp;index=5&amp;md5=153f21c3d39c2d1fc4137c34d66ca840\">Bipartisan Policy Center</a>'s nationwide initiative to strengthen our election process and, most recently, making the TurboVote digital tool accessible to all partners in the U.S. in an effort to increase voter registration and keep partners informed of local and national elections throughout the year.</li>\t<li><b>Creating A Sustainable Supply of Coffee For Future Generations:</b> Together with Conservation International, and 40 other organizations, Starbucks has launched the Sustainable Coffee Challenge, an industry-led initiative working to make coffee the first sustainable agricultural product. As part of that ongoing commitment and Starbucks comprehensive approach to ethical sourcing, Starbucks today announced that its highly successful, One Tree for Every Bag program is on track to donate 20 million rust resistant coffee tree seedlings to farmers in need by the end of the year. Designed to engage its customers in understanding more about where their coffee comes from, and offering a new way to scale farmer support, this program donates a coffee tree for every bag of coffee purchased in the U.S. through its partnership with Conservation International**. With many coffee growing regions around the world feeling the impact of coffee rust on their quality and supply of<i>arabica</i> coffee, this becomes a critical element in ensuring the longevity of the industry. In addition to the millions of pounds of green coffee this program will help farmers grow - helping to create economic stability for their communities and families - the development of seedling nurseries and a delivery infrastructure with supplier ECOM for the initiative will generate more than 1,600 jobs in the process. An initial 11 million rust resistant coffee seedlings will begin to be distributed in Guatemala, Mexico and El Salvador in May ahead of planting season in each of these countries. All of this work will be supported by Starbucks open sourced ethical sourcing program, C.A.F.E Practices, which offers agronomy information and tools in addition to financing for farmers worldwide in collaboration with Conservation International.</li>\t<li><b>Starbucks FoodShare - Hunger Relief in Action</b>: Starbucks is leading a national effort to provide nourishing, ready-to-eat meals to people in need with Starbucks FoodShare. Through a new and unique strategic alliance with Feeding America, Starbucks has set a goal to rescue 100% of food available to donate from its more than 7,000 U.S. stores. Working together, Starbucks will bring ready-to-eat, nourishing meals to scale for the millions who are in need, including breakfast sandwiches, Paninis, Bistro Boxes and salads. True to Starbucks mission to \"act with courage, challenge the status quo and find new ways to grow our company and each other,\" Starbucks partners advocated for a solution to donate unsold food and distribute it to those in need. In response to this call for action, Starbucks invested in research and quality assurance testing to develop a program to safely donate ready-to-eat meals to the 1 in 7 Americans who may not know where they will find their next meal. By this time next year, Starbucks hopes that partners in its U.S. company-operated stores will be able to add 5 million meals to the pastries they already donate today. And in the next five years, Starbucks will build on this commitment by engaging other companies and organizations to help end hunger with its strategic partner, Feeding America, the nation's largest domestic hunger-relief organization, and its nationwide network of food banks.</li></ul><p>Starbucks Annual Meeting of Shareholders began at 10 a.m. PT today, and will be webcast and can be accessed at <a href=\"http://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Finvestor.starbucks.com&amp;esheet=51306084&amp;newsitemid=20160323006248&amp;lan=en-US&amp;anchor=http%3A%2F%2Finvestor.starbucks.com&amp;index=6&amp;md5=6969e86b3e5657ac3695ea0d672d8fa4\">http://investor.starbucks.com</a>. A replay of the webcast will be available on the company's website until Friday, April 22, 2016. Please visit <a href=\"http://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fnews.starbucks.com&amp;esheet=51306084&amp;newsitemid=20160323006248&amp;lan=en-US&amp;anchor=http%3A%2F%2Fnews.starbucks.com&amp;index=7&amp;md5=ffe67ee72ccc3176ce624bb56a11da78\">http://news.starbucks.com</a> to find images, b-roll and live updates of the Annual Meeting of Shareholders.</p><p>Since 1971, Starbucks Coffee Company has been committed to ethically sourcing and roasting high-quality <i>arabica</i> coffee. Today, with stores around the globe, the company is the premier roaster and retailer of specialty coffee in the world. Through our unwavering commitment to excellence and our guiding principles, we bring the unique <i>Starbucks Experience</i> to life for every customer through every cup.</p><p>To share in the experience, please visit us in our stores or online at <a href=\"http://cts.businesswire.com/ct/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.starbucks.com&amp;esheet=51306084&amp;newsitemid=20160323006248&amp;lan=en-US&amp;anchor=www.starbucks.com&amp;index=8&amp;md5=f6166e0e6aba9d5054d93ac91d61a927\">www.starbucks.com</a>.</p><p><b>Forward Looking Statements</b></p><p>Certain statements contained herein are \"forward-looking statements\" within the meaning of the applicable securities laws and regulations. Generally, these statements can be identified by the use of words such as \"anticipate,\" \"expect,\" \"believe,\" \"could,\" \"estimate,\" \"feel,\" \"forecast,\" \"intend,\" \"may,\" \"plan,\" \" potential,\" \"project,\" \"should,\" \"will,\" \"would,\" and similar expressions intended to identify forward-looking statements, although not all forward-looking statements contain these identifying words. These statements are based upon information available to Starbucks as of the date hereof, and Starbucks actual results or performance could different materially from those stated or implied due to risks and uncertainties associated with its business. These risks and uncertainties include, but are not limited to, fluctuations in U.S. and international economies and currencies, our ability to preserve, grow and leverage our brands, potential negative effects of material breaches of our information technology systems to the extent we experience a material breach, potential negative effects of incidents involving food-borne illnesses, food tampering, food contamination or mislabeling, material failures of our information technology systems, costs associated with, and the successful execution of, the company's initiatives and plans, the acceptance of the company's products by our customers, the impact of competition, coffee, dairy and other raw materials prices and availability, the effect of legal proceedings, and other risks detailed in the company filings with the Securities and Exchange Commission, including the \"Risk Factors\" section of the Starbucks Annual Report on Form 10-K for the fiscal year ended September 27, 2015. The company assumes no obligation to update any of these forward-looking statements.</p><p>* Third-party brand with no link to Starbucks Coffee Company.</p><p>** Starbucks will contribute $.70, the average cost of a tree, to Conservation International for every bag of coffee sold from participating stores in the U.S. to foster thriving coffee communities. To learn more, visit conservation.org.</p><p><sup>1</sup> The comparable FY15 GAAP EPS of $1.82 includes certain Starbucks Japan acquisition-related items, specifically a $0.26 per share gain resulting from a fair value adjustment of Starbucks preexisting 39.5% ownership interest in Starbucks Japan and expenses of $0.03 per share related to ongoing amortization of acquired intangible assets and transaction and integration costs. In addition to the Starbucks Japan acquisition-related items, FY15 GAAP EPS includes a $0.03 per share loss related to the redemption of the company's $550 million of 6.250% 2017 Senior Notes and $0.04 per share incremental tax benefit related to U.S. manufacturing deductions to be claimed on our consolidated tax returns. The FY15 non-GAAP EPS growth rate is calculated over FY14 non-GAAP EPS of $1.33. FY14 GAAP EPS of $1.35 includes a $0.01 per share litigation credit related to the arbitration with Kraft Foods Global, Inc. and a $0.02 net benefit from transactions in Q4 FY14. The net benefit from transactions in Q4 FY14 relates primarily to a $0.02 gain on the sale of our Malaysia equity method investment, partially offset by a loss on the sale of our Australia retail operations and transaction costs incurred in Q4 FY14 related to the planned acquisition of Starbucks Japan.</p><p><sup>2</sup> The comparable FY15 GAAP operating income of $3,601.0 million includes expenses of $54.6 million related to certain Starbucks Japan acquisition-related items, specifically amortization of acquired intangible assets and transaction and integration costs. The FY15 non-GAAP operating income growth rate is calculated over FY14 non-GAAP operating income of $3,063.3 million. FY14 GAAP operating income of $3,081.1 million includes a credit of $20.2 million related to the arbitration with Kraft Foods Global, Inc. and $2.4 million of costs from transactions in Q4 FY14. The costs from transactions in Q4 FY14 include a portion of the transactions costs incurred in Q4 FY14 related to the acquisition of Starbucks Japan and costs related to the sale of our Australia retail operations in Q4 FY14.</p><p><img src=\"https://s2.yimg.com/bt/api/res/1.2/FPw31_gvG97_VZF_Nh00Zw--/YXBwaWQ9eW5ld3NfbGVnbztxPTg1O3c9NjMw/http://cts.businesswire.com/ct/CT?id=bwnews&amp;amp;sty=20160323006248r1&amp;amp;sid=5030&amp;amp;distro=ftp\"></p><p>View source version on businesswire.com: <a href=\"http://www.businesswire.com/news/home/20160323006248/en/\">http://www.businesswire.com/news/home/20160323006248/en/</a> </p></div>", "source": "Yahoo", "date": "Wed, 23 Mar 2016 17:00:00 GMT", "image": "https://ichart.finance.yahoo.com/t?s=sbux&lang=en-AU&region=AU"}]