[{
    "description": null,
    "title": "Apple Inc. Takes a Bold Risk With iPhone SE",
    "url": "http://www.fool.com/investing/general/2016/03/23/apple-inc-takes-a-bold-risk-with-iphone-se.aspx?source=yahoo-2&utm_campaign=article&utm_medium=feed&utm_source=yahoo-2",
    "symbol": "AAPL",
    "source": "Fool.com",
    "date": "Wed, 23 Mar 2016 19:30:00 GMT"
  },
  {
    "description": "[ACN Newswire] - HONG KONG, Mar 19, 2016 - (ACN Newswire) - V1 Group Limited (the \"Company\" or \"V1\") is pleased to announce that the results of the Company and its subsidiaries (the \"Group\") for the full year of 2015. The profit attributable to the owners of the Company amounted to HK$142,666,000, as compared with a loss of HK$131,590,000 last year. The main source of income for V1 Group's lottery-related business derives from the websites set up and operated by the partners of the Group, including Lottery 365, a strategic cooperative mobile application developed by the business partner of the Group, \"Zhongguozucaiwang\"(www.zgzcw.com) and \"Diyicai\"(www.diyicai.com).",
    "title": "Interpretation on the Results of V1 Group for the Full Year of 2015",
    "url": "http://au.finance.yahoo.com/news/interpretation-results-v1-group-full-015500147.html",
    "symbol": "BIDU",
    "source": "Yahoo",
    "date": "Sat, 19 Mar 2016 01:55:00 GMT"
  },
  {
    "description": "[Business Wire] - Electronic Arts Inc. today announced the official launch of EA SPORTS™ UFC® 2, available in retail stores and as a digital download on Xbox One and PlayStation 4. The game features the largest roster ever for an official UFC game, boasting more than 250 athletes, including cover stars, UFC featherweight champion Conor McGregor and former UFC bantamweight champion Ronda Rousey.",
    "title": "Finish the Fight in EA SPORTS UFC 2 Available Now",
    "url": "http://finance.yahoo.com/news/finish-fight-ea-sports-ufc-150000293.html",
    "symbol": "EA",
    "source": "Yahoo",
    "date": "Tue, 15 Mar 2016 15:00:00 GMT"
  },
  {
    "description": "[at MarketWatch] - Groupon stock tumbles after UBS downgrades the daily deals company to sell from neutral.",
    "title": "Groupon’s stock tumbles after UBS turns bearish",
    "url": "http://www.marketwatch.com/News/Story/Story.aspx?guid=63B8FF98-E632-11E5-B585-51929C806474&siteid=yhoof2",
    "symbol": "GRPN",
    "source": "Market Watch",
    "date": "Wed, 09 Mar 2016 21:40:42 GMT"
  },
  {
    "description": "[at Forbes] - The new Paul G. Allen Frontiers Group, backed by $100 million from the Microsoft co-founder, will provide vital funding to scientists with out-there ideas for solving medical problems.",
    "title": "Paul Allen's Plan To Pour $100M Into 'Out-Of-The-Box' Biotech Research",
    "url": "http://www.forbes.com/sites/arleneweintraub/2016/03/23/paul-allens-plan-to-pour-100m-into-out-of-the-box-biotech-research/?utm_campaign=yahootix&partner=yahootix",
    "symbol": "MSFT",
    "source": "Forbes",
    "date": "Wed, 23 Mar 2016 18:00:00 GMT"
  },
  {
    "description": "[Business Wire] - SEATTLE--(BUSINESSWIRE)-- Starbucks Corporation (NASDAQ:SBUX - News) today hosted its 24th Annual Meeting of Shareholders, with more than 2,800 partners, shareholders, invited guests and board members in attendance. Howard Schultz, chairman and ceo of Starbucks, honored the accomplishments of the company in delivering record financial results and introduced the company’s next level of social impact initiatives.",
    "title": "Building on Its Highest Total Shareholder Return in More Than Ten Years, Starbucks Presents Its Global Growth Agenda and Plans for Social Impact at Annual Meeting of Shareholders",
    "url": "http://au.finance.yahoo.com/news/building-highest-total-shareholder-return-170000871.html",
    "symbol": "SBUX",
    "source": "Yahoo",
    "date": "Wed, 23 Mar 2016 17:00:00 GMT"
  }
]